---
kind: other
id: Properties.T:Autodesk.Revit.DB.Architecture.HandRailType
source: html/11f1cf6b-5b98-7b6b-47df-9895524f557f.htm
---
# HandRailType Properties

The id of the assembly instance to which the element belongs.